Ran Plan for 3 projects:

1. dir: `main/ansible/ansible-instance` workspace: `default`
1. dir: `main/ansible` workspace: `default`
1. dir: `main/ansible/vpc-ansible` workspace: `default`

### 1. dir: `main/ansible/ansible-instance` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-20T06:21:13Z level=info msg=Downloading Terraform configurations from file:///root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/module/gcp/instances into /root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/ansible-instance/.terragrunt-cache/qlFbpE34wCO4vF-4RasDvFLMLKQ/4PXkA65U96hmj9g2LEGUGOVOWFI
time=2024-01-20T06:21:13Z level=info msg=All variables passed in by terragrunt are in use. prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/ansible-instance] 
time=2024-01-20T06:21:13Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/ansible-instance] 

time=2024-01-20T06:21:13Z level=warning msg=Versioning is not enabled for the remote state GCS bucket production-asofdevlabs. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/ansible-instance] 

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.10.0"...
- Installing hashicorp/google v5.10.0...
- Installed hashicorp/google v5.10.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_instance.default will be created
  + resource "google_compute_instance" "default" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + effective_labels        = (known after apply)
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-medium"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = "sudo apt update -y && sudo apt upgrade -y"
      + min_cpu_platform        = (known after apply)
      + name                    = "ansible-instance"
      + project                 = "production-410709"
      + self_link               = (known after apply)
      + tags                    = [
          + "http-server",
          + "https-server",
        ]
      + tags_fingerprint        = (known after apply)
      + terraform_labels        = (known after apply)
      + zone                    = "asia-southeast2-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2204-jammy-v20231213a"
              + labels = (known after apply)
              + size   = 10
              + type   = "pd-ssd"
            }
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = "default"
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ip-private-default = [
      + (known after apply),
    ]
  + ip-public-default  = [
      + [
          + (known after apply),
        ],
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/ansible-instance/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/ansible-instance/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d main/ansible/ansible-instance`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.101.234.123/lock?id=ahmadpiee%252Fatlantis-terraform%252Fmain%252Fansible%252Fansible-instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d main/ansible/ansible-instance`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `main/ansible` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible": 
time=2024-01-20T06:21:20Z level=warning msg=Versioning is not enabled for the remote state GCS bucket production-asofdevlabs. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible] 
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.
time=2024-01-20T06:21:20Z level=error msg=terraform invocation failed in /root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible
time=2024-01-20T06:21:20Z level=error msg=1 error occurred:
	* [/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible] exit status 1



time=2024-01-20T06:21:19Z level=warning msg=The following inputs passed in by terragrunt are unused:

time=2024-01-20T06:21:19Z level=warning msg=	- region
time=2024-01-20T06:21:19Z level=warning msg=	- zone
time=2024-01-20T06:21:19Z level=warning msg=	- credentials
time=2024-01-20T06:21:19Z level=warning msg=	- machine_type
time=2024-01-20T06:21:19Z level=warning msg=	- name
time=2024-01-20T06:21:19Z level=warning msg=	- project
time=2024-01-20T06:21:19Z level=warning
time=2024-01-20T06:21:19Z level=info msg=All required inputs are passed in by terragrunt
time=2024-01-20T06:21:19Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring.

```
</details>

---
### 3. dir: `main/ansible/vpc-ansible` workspace: `default`
<details><summary>Show Output</summary>

```diff
time=2024-01-20T06:21:21Z level=info msg=Downloading Terraform configurations from file:///root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/module/gcp/vpc into /root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/vpc-ansible/.terragrunt-cache/MGl8jPCJrj9bZQVvZhX6n4OeSYY/okr2-1KBNiw8HpRqRJzy2B5TYa8
time=2024-01-20T06:21:21Z level=warning msg=The following inputs passed in by terragrunt are unused:
 prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/vpc-ansible] 
time=2024-01-20T06:21:21Z level=warning msg=	- machine_type prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/vpc-ansible] 
time=2024-01-20T06:21:21Z level=warning prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/vpc-ansible] 
time=2024-01-20T06:21:21Z level=info msg=All required inputs are passed in by terragrunt prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/vpc-ansible] 
time=2024-01-20T06:21:21Z level=warning msg=Terragrunt configuration has misaligned inputs, but running in relaxed mode so ignoring. prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/vpc-ansible] 

time=2024-01-20T06:21:21Z level=warning msg=Versioning is not enabled for the remote state GCS bucket production-asofdevlabs. We recommend enabling versioning so that you can roll back to previous versions of your Terraform state in case of error. prefix=[/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/vpc-ansible] 

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/google versions matching "5.10.0"...
- Installing hashicorp/google v5.10.0...
- Installed hashicorp/google v5.10.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_network.default will be created
  + resource "google_compute_network" "default" {
      + auto_create_subnetworks                   = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "vpc-ansible"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + numeric_id                                = (known after apply)
      + project                                   = "production-410709"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # google_compute_subnetwork.subnet-default will be created
  + resource "google_compute_subnetwork" "subnet-default" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "192.168.101.0/24"
      + ipv6_cidr_range            = (known after apply)
      + name                       = "vpc-ansible"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "production-410709"
      + purpose                    = (known after apply)
      + region                     = (known after apply)
      + secondary_ip_range         = (known after apply)
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + vpc_self_link = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to:
/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/vpc-ansible/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/ahmadpiee/atlantis-terraform/21/default/main/ansible/vpc-ansible/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d main/ansible/vpc-ansible`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.101.234.123/lock?id=ahmadpiee%252Fatlantis-terraform%252Fmain%252Fansible%252Fvpc-ansible%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d main/ansible/vpc-ansible`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`